tasks.tex
% Created 2020-10-10 Сб 19:51
% Intended LaTeX compiler: xelatex
\documentclass{extarticle}
                

\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{breqn}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage{polyglossia}
\setmainlanguage{russian}
\setotherlanguage{english}
\setkeys{russian}{babelshorthands=true}
\PolyglossiaSetup{russian}{indentfirst=true}
\usepackage{fontspec}
\setmainfont{Liberation Serif}
\usepackage{minted}
\usepackage[left=4cm,right=4cm, top=2cm,bottom=2cm,bindingoffset=0cm]{geometry}
\usepackage{xcolor}
\PassOptionsToPackage{final}{graphicx}
\usepackage{caption}
\usepackage{subcaption}
\usepackage{wrapfig}
\usepackage{array}
\definecolor{friendlybg}{HTML}{f0f0f0}
\date{}
\title{Задачи на поиск в глубину}
\hypersetup{
 pdfauthor={},
 pdftitle={Задачи на поиск в глубину},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.4)}, 
 pdflang={Russian}}
\begin{document}



\section*{Задача 1}
\label{sec:orgbf94f14}
В небольшой стране \(n\) городов.
Каждый город имеет номер — целое число от \(1\) до \(n\).
Столица имеет номер \(g_{1}\).
Дороги между городами двухсторонние, причем
есть только один путь от столицы до каждого города.

Карта хранится в следующем виде:
для каждого не столичного города \(i\) хранится число \(r_{i}\) -
номер последнего города на пути из столицы в город \(i\).

Было решено перенести столицу из города \(g_{1}\) в город \(g_{2}\).
После этого старое представление карты перестало быть верным.
Необходимо найти новое представление карты дорог в описанном выше виде.

\section*{Задача 2}
\label{sec:org0cfcf12}
Имеется \(n\) людей. Они общаются в \(m\) группах.
Человек \(x\) узнает новость из внешнего источника.
Затем этот пользователь отправляет новость всем своим друзьям
(друзья если оба общаются в какой-нибудь группе).
Друзья сообщают новость своим друзьям и тд.
Это происходит до того, как не останется пары друзе, в которой один
знает новость, а другой - нет.

Группы заданы списком групп состоязщих из списков участников группы.

Для каждого пользователя необходимо определить сколько пользователей узнает
новость, если он начнет её распространять.
Тоесть необходимо получить список из количество узнавших новость для каждого человека.

\section*{Задача 3}
\label{sec:org4ca004e}
В старом доме Антона был определён план
расположения комнат и коридоров между ними.
Коридоры двусторонние.
Комнаты пронумерованы от \(1\) до \(n\).

Антон хочет, чтобы новый дом выглядел также как и предыдущий.
Для этого в нем должно быть \(n\) комнат и если существовал
коридор из \(i\) в \(j\), то он есть в новом доме.

Антон строит дом так, что он начинает строить коридор из
некоторой комнаты и пробивает их до тех пор, пока
не получит все коридоры и вернётся в начальную комнату.

Также известно, что Антон строит, не прерываясь, то есть пока не
закончит строительство. По уже построенным коридорам он не ходит.

Антону скучно строить коридоры в одном порядке. Поэтому он,
зная порядок построения коридоров в предыдущем доме, хочет
построить коридоры в другом порядке.
Этот порядок представляет собой список комнат в процессе их
посещения.
Новый список должен быть лексикографически наименьший,
но строго больше предыдущего.

Дан список описывающий старый маршрут.
Гарантируется, что последнее число в этом списке
совпадает с первым.
Первая комната - это главный вход, поэтому Антон всегда
должен начинать строить именно с неё.

Можете предполагать, что ни одна комната не соединена сама
с собой коридором, и если существует коридор между
некоторой парой комнат, то только один.
В то же время, могут существовать изолированные комнаты,
не соединённые коридорами вообще.

На выходе должен получится либо список описывающий новый маршрут,
либо None если это невозможно.

\section*{Задача 4}
\label{sec:org7eced27}
Дан неориентированный граф из \(n\) вершин
и \(m\) ребер.
Вершины пронумерованы целыми числами от \(1\) до \(n\).
Граф простой (без петель и между каждой парой вершин не более одного ребра).

\textbf{Граф гармоничный} если для каждой тройки целых чисел \((l,m,r)\), где
\(1 \leq l < m < r \leq n\),
если есть путь из вершины \(l\) в вершину \(r\),
тогда существует путь из вершины \(l\) в вершину \(m\).

Тоесть, в гармоничном графе, если из вершины \(l\)
можно по ребрам дойти до вершины
\(r\) (\(l<r\)), тогда также должно быть можно
дойти до вершин \((l+1),(l+2),\dots,(r−1)\).

Найдите минимальное число ребер которых надо добавить в граф,
чтобы он стал гармоничным.

\section*{Задача 5}
\label{sec:orgab4e343}
Турнир — ориентированный граф без петель, в котором каждая
пара вершин соединена ровно одним ребром.
Для любых двух вершин \(u\) и \(v\) (\(u \neq v\)) либо есть ребро из
\(u\) в \(v\), либо есть ребро из \(v\) в \(u\).

Дан турнир из \(n\) вершин.
Он задан матрицой смежности.
Требуется найти в нем цикл длины три.
\end{document}
